// Config version.
version : 7

// Default configuration.
config : {

	// Is the current rotation index persistent? If true, the rotation will continue after server restart,
	// If false, the rotation will always start from the first setup.
	// You can always delete the sms_rotate_data.json file from lua_config to reset the persisted index.
	"persist_index" : true,

	// The default setup. This is a table with attributes and values. The following rules apply to the attributes:
	// - If TrackId is specified: The track to enforce. Automatically sets 1 to ServerControlsTrack
	// - If VehicleModelId is specified: The vehicle to enforce. Automatically sets 1 to ServerControlsVehicle, sets FORCE_IDENTICAL_VEHICLES to Flags
	// - If VehicleClassId is specified: The class to enforce. Automatically sets 1 to ServerControlsVehicleClass, sets FORCE_SAME_VEHICLE_CLASS to Flags
	// - Track, vehicle model, vehicle class and all enum/flags attributes can use values in string forms - so you can use either track id, or track name.
	// - Flags in string form can contain multiple flags separated by comma, so for example "ABS_ALLOWED,SC_ALLOWED,TCS_ALLOWED"
	// - The setup should never contain any of the "ServerControls" attributes, those are decided automatically.
	// - The setup should never contain both VehicleModelId and VehicleClassId at the same time. Restrict either the class or specific vehicle.
	// - The Flags attribute should never contain FORCE_IDENTICAL_VEHICLES or FORCE_SAME_VEHICLE_CLASS flags, those are decided automatically.
	"default" : {
		"PracticeLength" : 10,
		"QualifyLength" : 10,
		"RaceLength" : 10,

		"Flags" : "ALLOW_CUSTOM_VEHICLE_SETUP,ABS_ALLOWED,SC_ALLOWED,TCS_ALLOWED,FORCE_REALISTIC_DRIVING_AIDS,FILL_SESSION_WITH_AI,AUTO_START_ENGINE,TIMED_RACE,PIT_SPEED_LIMITER",
		"DamageType" : "FULL",
		"TireWearType" : "STANDARD",
		"FuelUsageType" : "STANDARD",
		"PenaltiesType" : "FULL",
		"AllowedViews" : "Any",

		"RaceDateHour" : 15,

		"RaceWeatherSlots" : 1,
		"RaceWeatherSlot1" : "Clear",
		"RaceWeatherSlot2" : "Clear",
		"RaceWeatherSlot3" : "Clear",
		"RaceWeatherSlot4" : "Clear",
	},

	// The rotation. Array of setups to rotate. If empty, just the default setup will be used with no actual rotation happening.
	//
	// These setups are applied on top of the default setup, then applied to the game. Previous setup in the rotation is never used.
	// So for example if you wanted to repeat the same track in multiple consecutive setups, different from the default track,
	// each of those setups needs to explicitly include that track. Also remember that apart from the flags nothing can be "removed"
	// from the default setup, so if the default setup contains a track, some track will always be enforced (either the default one,
	// or the setup-specific one). And one last thing, these override setups can never include an attribute that's not specified in
	// the default setup - it can just override some of the default attributes, not add new ones. The only exception are the
	// track/vehicle/class attributes.
	//
	// Attributes in these setups can have a special attribute RemoveFlags set, which will remove the specified flags from the default
	// setup instead of adding them to it (which is what the Flags attribute will do)
	"rotation" : [
		{
			"TrackId" : "Interlagos",
			"VehicleClassId" : "StockCarV8",
		},
		{
			"VehicleClassId" : "SprintRace",
			"TrackId" : "Londrina Long",
			// Formula C on Silverstone with silly time/weather settings. 10 minutes qualify then 5 lap race.
			// override start time and race length
			"RaceLength" : 8,
			"RaceDateHour" : 17,
			
			// set weather for this event
			"RaceWeatherSlots" : 4,
			"RaceWeatherSlot1" : "Clear",
			"RaceWeatherSlot2" : "MediumCloud",
			"RaceWeatherSlot3" : "Storm",
			"RaceWeatherSlot4" : "LightCloud",
		}
	]
}
